artillery/ddp-reactive-lean.yml
config:
  # target is overridden at runtime by drivers/artillery.js (--target +
  # REMOTE_URL) to point at BENCH_PORT. Kept here so the file runs standalone.
  target: http://localhost:3000
  # Lean, precise profile: deliberately light load kept well below machine
  # capacity so timing metrics reflect true latency (no queueing/contention
  # noise). Short warm up + a steady-state long enough to gather stable
  # percentiles. Meant to be run repeatedly per config and compared/medianed.
  phases:
    - duration: 15
      arrivalRate: 2
      name: Warm up
    - duration: 100
      arrivalRate: 3
      name: Sustained light reactive load
  processor: '../tests/ddp-helpers.js'
scenarios:
  - name: Reactive DDP CRUD (shared high-fanout pub)
    engine: http
    beforeScenario: reactiveCrud
    flow:
      - log: "DDP VU complete"