artillery/non-reactive-stress.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Warm up
  ensure:
    maxErrorRate: 1
    max: 500
  # Load the Playwright engine:
  engines:
    playwright:
      launchOptions:
        slowMo: 1000
  # Path to JavaScript file that defines Playwright test functions
  processor: '../tests/test-helpers.js'
scenarios:
  - engine: playwright
    testFunction: 'nonReactiveAddAndRemoveTasks'